{
    "common": {
        "name": "hue-extended",
        "version": "2.0.0-beta.1",
        "title": "Philips Hue Extended",
        "desc": {
            "en": "Integration of all your Philips Hue or deCONZ / Conbee devices with your ioBroker",
            "de": "Integration aller Philips Hue oder deCONZ / Conbee Geräte mit Ihrem ioBroker",
            "ru": "Интеграция всех ваших устройств Philips Хюэ с ioBroker",
            "pt": "A integração de todos os seus Philips Hue Dispositivos com a sua ioBroker",
            "nl": "Integratie van al uw Philips Hue-Apparaten met uw ioBroker",
            "fr": "L'intégration de l'ensemble de votre Philips Hue Appareils avec votre ioBroker",
            "it": "L'integrazione di tutte le Philips Hue Dispositivi con il ioBroker",
            "es": "La integración de todos sus Philips Hue Dispositivos con la ioBroker",
            "pl": "Integracja wszystkich urządzeń Philips Hue z ioBroker",
            "zh-cn": "一体化的所有飞利浦色调设备与你ioBroker"
        },
        "news": {
            "1.3.8": {
                "en": "- fixed long-time polling for connection retry after connection fails serval times on short-time polling (see #58)",
                "de": "- Feste long-time-polling für die Verbindung erneut, nachdem die Verbindung fehlschlägt serval mal auf short-time polling (siehe #58)",
                "ru": "- исправлена долгое время опроса для подключения повторите попытку после неудачного подключения сервала раз на короткое время опроса (см. #58)",
                "pt": "- corrigido o longo tempo de pesquisa para tentativas de ligação após ligação falhar serval vezes em um curto tempo de polling (consulte #58)",
                "nl": "- vaste lange tijd polling voor de verbinding opnieuw nadat de verbinding is mislukt serval keer op korte tijd polling (zie #58)",
                "fr": "- correction d'un long temps d'interrogation pour les tentatives de connexion après l'échec de la connexion serval fois sur le court temps d'interrogation (voir n ° 58)",
                "it": "- fisso lungo-tempo di polling per un nuovo tentativo di connessione dopo la connessione non riesce serval volte in breve tempo di polling (vedi #58)",
                "es": "- fija de sondeo en tiempo de reintento de conexión después de la conexión falla serval veces en corto tiempo de sondeo (ver #58)",
                "pl": "- naprawiono długi czas ankiety do podłączenia spróbuj ponownie po nieudanym połączenia сервала razy w krótkim czasie odpytywania (patrz #58)",
                "zh-cn": "-固定长的时间投票试重新连接之后的连接失败薮次短的时间投票(见#58)"
            },
            "1.3.7": {
                "en": "- added additional verification checks of the response received from the Hue Bridge (see #45)\n- fixed long-time polling for connection retry after connection fails serval times on short-time polling (see #58)",
                "de": "- zusätzliche überprüfung der erhaltenen Antwort aus dem Farbton-Brücke (siehe #45)\n- Feste long-time-polling für die Verbindung erneut, nachdem die Verbindung fehlschlägt serval mal auf short-time polling (siehe #58)",
                "ru": "- добавлены дополнительные проверки ответа, полученного от Hue мост (см. #45)\n- исправлена долгое время опроса для подключения повторите попытку после неудачного подключения сервала раз на короткое время опроса (см. #58)",
                "pt": "- adicional de verificação da resposta recebida da Tonalidade Ponte (ver #45)\n- corrigido o longo tempo de pesquisa para tentativas de ligação após ligação falhar serval vezes em um curto tempo de polling (consulte #58)",
                "nl": "- extra controle controle van de reactie van de Hue Bridge (zie #45)\n- vaste lange tijd polling voor de verbinding opnieuw nadat de verbinding is mislukt serval keer op korte tijd polling (zie #58)",
                "fr": "- ajouté des contrôles de vérification de la réponse reçue de la Teinte du Pont (voir n ° 45)\n- correction d'un long temps d'interrogation pour les tentatives de connexion après l'échec de la connexion serval fois sur le court temps d'interrogation (voir n ° 58)",
                "it": "- aggiunta di ulteriori verifiche della risposta ricevuta dalla Tonalità Ponte (vedi #45)\n- fisso lungo-tempo di polling per un nuovo tentativo di connessione dopo la connessione non riesce serval volte in breve tempo di polling (vedi #58)",
                "es": "- añadido adicional, la verificación de la respuesta recibida de los Hue Bridge (ver #45)\n- fija de sondeo en tiempo de reintento de conexión después de la conexión falla serval veces en corto tiempo de sondeo (ver #58)",
                "pl": "- dodano dodatkowe testy odpowiedzi otrzymanej od Hue bridge (patrz #45)\n- naprawiono długi czas ankiety do podłączenia spróbuj ponownie po nieudanym połączenia сервала razy w krótkim czasie odpytywania (patrz #58)",
                "zh-cn": "-增加额外的核查检查所收到的响应顺桥(见第45)\n-固定长的时间投票试重新连接之后的连接失败薮次短的时间投票(见#58)"
            },
            "1.3.6": {
                "en": "- added long-time polling for connection retry after connection fails serval times on short-time polling (see #58)",
                "de": "- Hinzugefügt long-time-polling für die Verbindung erneut, nachdem die Verbindung fehlschlägt serval mal auf short-time polling (siehe #58)",
                "ru": "- добавлено давний опрос для подключения повторите попытку после неудачного подключения сервала раз на короткое время опроса (см. #58)",
                "pt": "- adicionado longo tempo de pesquisa para tentativas de ligação após ligação falhar serval vezes em um curto tempo de polling (consulte #58)",
                "nl": "- toegevoegd lange tijd polling voor de verbinding opnieuw nadat de verbinding is mislukt serval keer op korte tijd polling (zie #58)",
                "fr": " ajoutée à long temps d'interrogation pour les tentatives de connexion après l'échec de la connexion serval fois sur le court temps d'interrogation (voir n ° 58)",
                "it": " aggiunto da lungo tempo di polling per un nuovo tentativo di connessione dopo la connessione non riesce serval volte in breve tempo di polling (vedi #58)",
                "es": "- añadido largo sondeo en tiempo de reintento de conexión después de la conexión falla serval veces en corto tiempo de sondeo (ver #58)",
                "pl": "- dodano długoletni ankieta dla połączenia spróbuj ponownie po nieudanym połączenia сервала razy w krótkim czasie odpytywania (patrz #58)",
                "zh-cn": " 增长的时间投票试重新连接之后的连接失败薮次短的时间投票(见#58)"
            },
            "1.3.5": {
                "en": "- added action onOffAllLights for groups to reflect state of ALL lights and turn on/off all lights at once (respectively, the on state for groups reflects the state of any_on).",
                "de": "- Hinzugefügt Aktion onOffAllLights für Gruppen zu reflektieren, den Status ALLER Lichter und turn-on/off alle Lichter auf einmal (bzw. in den Status für Gruppen spiegelt den Zustand der any_on).",
                "ru": "- добавлено действие onOffAllLights для группы, чтобы отразить состояние всех огней и включение/выключение всех огней сразу (соответственно, на государство для групп отражает состояние any_on).",
                "pt": "- adicionado ação onOffAllLights para grupos para refletir o estado de TODAS as luzes e ligar/desligar todas as luzes de uma vez (respectivamente, o estado, para grupos reflete o estado de any_on).",
                "nl": " de toegevoegde actie onOffAllLights voor groepen om te reflecteren staat van ALLE lichten uit en draai de aan/uit alle lampjes in een keer (respectievelijk de aan-stand voor groepen weerspiegelt de toestand van any_on).",
                "fr": "- ajout de l'action onOffAllLights pour les groupes à refléter l'état de TOUTES les lumières et allumer/éteindre toutes les lumières à la fois (respectivement, l'état pour les groupes reflète l'état de any_on).",
                "it": "- aggiunta l'azione onOffAllLights per gruppi a riflettere di stato di TUTTE le luci e accendere/spegnere tutte le luci in una volta (rispettivamente, di stato per gruppi riflette lo stato di any_on).",
                "es": "- añadido acción onOffAllLights para grupos, para reflejar el estado de TODAS las luces y encender/apagar todas las luces a la vez (respectivamente, en el estado para grupos refleja el estado de any_on).",
                "pl": "- dodano czynność onOffAllLights dla grupy, aby odzwierciedlić stan wszystkich świateł i włączenie/wyłączenie wszystkich świateł na raz (odpowiednio, na państwo dla grup odzwierciedla stan any_on).",
                "zh-cn": "-加入行动onOffAllLights团体，以反映国家的所有灯光和关闭所有的灯一次(分别于国家的团体反映了国家的any_on)."
            },
            "1.3.2": {
                "en": "- fixed on state being disappeared",
                "de": "- auf festen Zustand als verschwunden",
                "ru": "- Исправлена ошибка на государство исчезло",
                "pt": "- corrigido no estado, sendo desapareceu",
                "nl": "- vast op staat wordt verdween",
                "fr": "- correction sur l'état de l'être disparu",
                "it": "- risolto in stato di essere scomparso",
                "es": "- se fija en estado de ser desaparecido",
                "pl": "- Naprawiono błąd na państwo zniknęło",
                "zh-cn": "-上的固定状态正在消失"
            },
            "1.3.1": {
                "en": "- added check for http status code to the response received from the Hue Bridge (see #45)\n- second try changing state on of a group to match state any_on (see #19)",
                "de": "- Hinzugefügt check für http-status-code die Antwort erhielt Sie von der Hue-Bridge (siehe #45)\n- zweiter Versuch ändern des Status auf einer Gruppe übereinstimmen Staat any_on (siehe #19)",
                "ru": "- добавлена проверка на код состояния HTTP в ответе получил от Hue мост (см. #45)\n- вторая попытка изменения состояния на группы, чтобы соответствовать государственным any_on (см. #19)",
                "pt": " adicionado verificar código de status http para a resposta recebida da Tonalidade Ponte (ver #45)\n- segunda tente alterar o estado de um grupo para corresponder estado any_on (ver item 19)",
                "nl": " toegevoegd controleren http status code van de reactie van de Hue Bridge (zie #45)\n- tweede proberen veranderende status van een groep naar een wedstrijd staat any_on (zie #19)",
                "fr": "- ajout d'une vérification pour le code de statut http de la réponse reçue de la Teinte du Pont (voir n ° 45)\n- deuxième essayez de changer l'état d'un groupe de correspondance de l'état any_on (voir n ° 19)",
                "it": "- aggiunto un controllo per il codice di stato http per la risposta ricevuta dalla Tonalità Ponte (vedi #45)\n- seconda prova a cambiare stato, di un gruppo di match di stato any_on (vedi #19)",
                "es": "- se ha añadido la verificación de código de estado http de la respuesta recibida de los Hue Bridge (ver #45)\n- segundo intento cambiar el estado de un grupo para que coincida con el estado de any_on (ver #19)",
                "pl": "- dodano sprawdzanie kod stanu HTTP w odpowiedzi otrzymał od Hue bridge (patrz #45)\n- druga próba zmiany stanu na grupy, aby być zgodne z krajowymi any_on (patrz #19)",
                "zh-cn": "-增加检查http status code到所收到的响应顺桥(见第45)\n-第二次尝试改变态上的一个小组到比赛状态any_on(见第19)"
            },
            "1.3.0": {
                "en": "- added option to only set devices in a group which are already turned on (thus devices which are off are not set) (see #19)\n- added option to set brightness / level to 0 when device is not reachable (see #38)\n- change state on of a group to match state any_on (see #19)",
                "de": "- option Hinzugefügt, um nur setzen Sie die Geräte in einer Gruppe, die bereits eingeschaltet sind (also Geräte, die ausgeschaltet sind, sind nicht festgelegt) (siehe #19)\n- option Hinzugefügt, um Helligkeit / Stufe 0, wenn das Gerät nicht erreichbar ist (siehe #38)\n- ändern des Status auf einer Gruppe übereinstimmen Staat any_on (siehe #19)",
                "ru": "- добавлена возможность установить устройства в группе, которая уже включена (при этом устройства, которые отключены не установлены) (см. #19)\n- добавлена опция, чтобы установить уровень яркости / к 0, когда устройства недоступны (см. #38)\n- изменение состояния на группы, чтобы соответствовать государственным any_on (см. #19)",
                "pt": "- adicionada opção para só conjunto de dispositivos em um grupo que já estão ativados (assim, os dispositivos que estão fora não definido) (ver item 19)\n- adicionada opção para ajustar o brilho e o nível para 0 quando o dispositivo não está acessível (ver #38)\n- alteração do estado de um grupo para corresponder estado any_on (ver item 19)",
                "nl": "- optie toegevoegd om alleen apparaten in een groep die al is ingeschakeld (dus de apparaten die uitgeschakeld zijn niet ingesteld) (zie #19)\n- optie toegevoegd om de helderheid / niveau op 0 wanneer het apparaat is niet bereikbaar (zie #38)\n- verander status op van een groep naar een wedstrijd staat any_on (zie #19)",
                "fr": "- ajout de l'option de définir les périphériques d'un groupe qui a déjà activé (donc des appareils qui sont off ne sont pas définies) (voir n ° 19)\n- ajout d'une option pour régler la luminosité / niveau à 0 lorsque l'appareil n'est pas accessible (voir n ° 38)\n- changement d'état d'un groupe de correspondance de l'état any_on (voir n ° 19)",
                "it": "- aggiunta l'opzione per impostare solo i dispositivi in un gruppo già acceso (e quindi i dispositivi di sconto non sono impostate) (vedi #19)\n- aggiunta l'opzione per impostare la luminosità / livello 0 quando il dispositivo non è raggiungibile (vedi #38)\n- cambiamento di stato di un gruppo di match di stato any_on (vedi #19)",
                "es": "- añadida la opción para configurar los dispositivos en un grupo que ya están activados (por lo tanto los dispositivos que no están establecidas) (ver #19)\n- añadida la opción para ajustar el brillo / nivel 0 cuando el dispositivo no es accesible (ver #38)\n- cambio de estado de un grupo para que coincida con el estado de any_on (ver #19)",
                "pl": "- dodano możliwość ustawienia urządzenia w grupie, która jest już włączona (w tym urządzenia, które są wyłączone nie są zainstalowane) (patrz #19)\n- dodano opcję, aby ustawić poziom jasności / do 0, gdy urządzenia nie są dostępne (patrz #38)\n- zmiana stanu na grupy, aby być zgodne z krajowymi any_on (patrz #19)",
                "zh-cn": "-增加的选择，只有设备的一组已经开(因此这些都是关闭是不设置)(参见第19)\n-增加选择来设定明度/水平为0时设备是不可访问(见#38)\n-改变态上的一个小组到比赛状态any_on(见第19)"
            },
            "1.2.3": {
                "en": "- added Signify (formerly Philips Lighting) as official manufacturer\n- updated dependencies",
                "de": "- Hinzugefügt Erklären (ehemals Philips Lighting) als offizieller Hersteller\n- Abhängigkeiten aktualisiert",
                "ru": "- добавлены обозначения (ранее Philips \"световые решения\") в качестве официального производителя\n- обновление зависимостей",
                "pt": "- adicionado Significar (antiga Philips Lighting) como fabricante oficial\n- atualizado dependências",
                "nl": "- toegevoegd Betekenen (voorheen Philips Lighting) als officiële fabrikant\n- bijgewerkt afhankelijkheden",
                "fr": " ajoutée Représentent (anciennement Philips Lighting) en tant que fabricant officiel\n- mise à jour des dépendances",
                "it": "- aggiunto Significare (ex Philips Lighting) come produttore ufficiale di\n- aggiornato dipendenze",
                "es": "- añadido Significar (antes de Iluminación de Philips) como fabricante oficial\n- actualizado a las dependencias",
                "pl": "- dodano oznaczenia (dawniej Philips oświetlenia) jako oficjalnego producenta\n- aktualizacja zależności",
                "zh-cn": "-增加意味着(前身是飞利浦照明)作为官方制造商\n-更新的依赖性"
            },
            "1.2.2": {
                "en": "- fixed wrong group state (see #19)",
                "de": "- fixed falsche Gruppe Zustand (siehe #19)",
                "ru": "- исправлено неверное группы (см. #19)",
                "pt": "- corrigido erro de grupo estado (ver item 19)",
                "nl": "- vaste verkeerde groep staat (zie #19)",
                "fr": "- correction d'un mauvais état de groupe (voir n ° 19)",
                "it": "- corretto errore di gruppo (vedi #19)",
                "es": "- corregido mal estado del grupo (ver #19)",
                "pl": "- poprawiono błędne grupy (patrz #19)",
                "zh-cn": "-定是错误的组国家(见第19)"
            },
            "1.2.1": {
                "en": "- fixed failing secure connection when selecting default certificates",
                "de": "- Feste Versagen sichere Verbindung bei der Auswahl von Standard-Zertifikate",
                "ru": "- Исправлен сбой защищенного соединения при выборе по умолчанию сертификаты",
                "pt": "- corrigido falha de conexão segura quando a seleção padrão certificados",
                "nl": "- vaste, bij gebreke van een beveiligde verbinding bij het selecteren van de standaard certificaten",
                "fr": "- correction d'un échec de la connexion sécurisée lors de la sélection des certificats par défaut",
                "it": "- risolto in mancanza di connessione sicura quando la selezione di default certificati",
                "es": "- fijo su defecto conexión segura cuando se selecciona por defecto certificados",
                "pl": "- Naprawiono błąd bezpiecznego połączenia przy wyborze domyślne certyfikaty",
                "zh-cn": "-固定失败的安全连接当选择默认证书"
            },
            "1.2.0": {
                "en": "- added option to change transitiontime on scenes (see #24)",
                "de": "- option Hinzugefügt, um zu ändern transitiontime auf Szenen (siehe #24)",
                "ru": "- добавлена возможность менять transitiontime на сцены (см. #24)",
                "pt": "- adicionada opção para alterar transitiontime em cenas (ver #24)",
                "nl": "- optie toegevoegd om de verandering transitiontime op scènes (zie #24)",
                "fr": "- ajout d'une option pour changer transitiontime sur les scènes (voir n ° 24)",
                "it": "- aggiunta l'opzione per cambiare transitiontime sulle scene (vedi #24)",
                "es": "- añadida opción para cambiar transitiontime en las escenas (ver #24)",
                "pl": "- dodano możliwość zmiany transitiontime na sceny (patrz #24)",
                "zh-cn": "-增加的选择来改变transitiontime上的场景(参见#24)"
            }
        },
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "mode": "daemon",
        "icon": "hue-extended.png",
        "extIcon": "https://raw.githubusercontent.com/Zefau/ioBroker.hue-extended/master/admin/hue-extended.png",
        "keywords": [
            "hue",
            "conbee",
            "deconz",
            "raspbee",
            "zigbee",
            "lights",
            "groups",
            "scenes",
            "hue-labs",
            "sensors",
            "schedules",
            "rules",
            "config",
            "extended"
        ],
        "readme": "https://github.com/Zefau/ioBroker.hue-extended/blob/master/README.md",
        "loglevel": "info",
        "materialize": true,
        "compact": true,
        "enabled": true,
        "localLink": "https://%bridgeIp%/debug/clip.html",
        "messagebox": true,
        "subscribe": "messagebox",
        "type": "lighting",
        "authors": [
            {
                "name": "Zefau",
                "email": "zefau@mailbox.org"
            }
        ]
    },
    "native": {
        "refresh": 30,
        "syncLights": true,
        "syncGroups": true,
        "syncScenes": true,
        "syncHueLabsScenes": true,
        "syncScenesRecycled": true,
        "hueToXY": true,
        "useQueue": false,
        "sceneNaming": "room"
    },
    "objects": [],
    "instanceObjects": []
}